@jacobbednarz closing this with no action is pretty lame. There are cases that the terraform provider cannot handle - the whole point of using terraform instead of manually using the Dashboard is so it can be reapplied and so the state of the resources are what is committed in the repo. At the moment, I cannot create the same set of rules with terraform that I can with the Dash, and if I create a rule that is close to what I need then modify it in the Dash, it breaks terraform state and there is no way to recover other than delete the rule outright.

Also you acknowledged the misleading error message but don't want to fix it?

@zakcutner the issue is not about `action_parameters`, it is about creating a rule with `action = "block"` and `enabled = "false"` which according to the API docs you posted above, should be possible. I took your point that `ruleset` is not a valid `action_parameter` when `action = "block"` - another documentation opportunity: I don't know what is valid there - so I removed it and now I get a more sensible error message
```
Terraform will perform the following actions:

  # cloudflare_ruleset.custom-firewall-rules will be updated in-place
  ~ resource "cloudflare_ruleset" "custom-firewall-rules" {
        id      = "402d91f22dd8400c8a0b24951fa0e6c5"
        name    = "default"
        # (3 unchanged attributes hidden)

      ~ rules {
          ~ action       = "skip" -> "block"
          ~ enabled      = false -> true
          ~ id           = "c7c764a36ec641db8c5c1e340662e90d" -> (known after apply)
          ~ last_updated = "2023-12-07 02:07:58.856611 +0000 UTC" -> (known after apply)
          ~ ref          = "c7c764a36ec641db8c5c1e340662e90d" -> (known after apply)
          ~ version      = "1" -> (known after apply)
            # (2 unchanged attributes hidden)

          - action_parameters {
              - ruleset = "current" -> null
            }

          ~ logging {
              ~ enabled = true -> false
            }
        }
    }

Plan: 0 to add, 1 to change, 0 to destroy.
cloudflare_ruleset.custom-firewall-rules: Modifying... [id=402d91f22dd8400c8a0b24951fa0e6c5]
╷
│ Error: error updating ruleset with ID "402d91f22dd8400c8a0b24951fa0e6c5"
│
│   with cloudflare_ruleset.custom-firewall-rules,
│   on cloudflare-waf.tf line 1, in resource "cloudflare_ruleset" "custom-firewall-rules":
│    1: resource "cloudflare_ruleset" "custom-firewall-rules" {
│
│ logging options only allowed in the skip action (20018)
╵
```

Why can't the provider return a sensible error message like that telling me `ruleset options only allowed in the skip action`?